name: "ensemble_dali_yolo_v4"
platform: "ensemble"
max_batch_size: 1
input [
  {
    name: "INPUT"
    data_type: TYPE_UINT8
    format: FORMAT_NHWC
    dims: [ 416,416,3 ] 			
  }
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_FP32
    dims: [ -1, -1, 3, 85 ]
  },
  {
    name: "OUTPUT_1"
    data_type: TYPE_FP32
    dims: [ -1, -1, 3, 85 ]
  },
  {
    name: "OUTPUT_2"
    data_type: TYPE_FP32
    dims: [ -1, -1, 3, 85 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "dali"
      model_version: -1
      input_map {
        key: "DALI_INPUT_0"
      
  value: "INPUT"
      }
      output_map {

        key: "DALI_OUTPUT_0"
        value: "preprocessed_image"
      }
    },
    {
      model_name: "yolo_v4"
      model_version: -1
      input_map {
        key: "input_1:0"
        value: "preprocessed_image"
      }
      output_map {

        key: "Identity:0"

        value: "OUTPUT"
      }
      output_map {

        key: "Identity_1:0"

        value: "OUTPUT_1"
      }
      output_map {

        key: "Identity_2:0"
        value: "OUTPUT_2"
      }
    }
  ]
}
  
